# NoStructuralHostToAttachWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..NoStructuralHostToAttachWarning Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
There is no structural component to attach the hanger rod to.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoStructuralHostToAttachWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoStructuralHostToAttachWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoStructuralHostToAttachWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace